## Pivot Table

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    880     30   John  January      Q1
1  2023-01-02       B   West    576     97   Mary  January      Q1
2  2023-01-03       C  North    126     44    Bob  January      Q1
3  2023-01-04       D  South    774     73  Alice  January      Q1
4  2023-01-05       A   East    867     45   John  January      Q1
5  2023-01-06       B   West    722     96   Mary  January      Q1
6  2023-01-07       C  North    901     50    Bob  January      Q1
7  2023-01-08       D  South    655     41  Alice  January      Q1
8  2023-01-09       A   East    229     25   John  January      Q1
9  2023-01-10       B   West    908     46   Mary  January      Q1
10 2023-01-11       C  North    409     55    Bob  January      Q1
11 2023-01-12       D  South    942     67  Alice  January      Q1
12 2023-01-13       A   East    311     40   John  January      Q1
13 2023-01-14       B   West    718     54   Mary  January      Q1
14 2023-01-15       C  North    411     69    Bob  January      Q1
15 2023-01-16       D  South    971     66  Alice  January      Q1
16 2023-01-17       A   East    735     42   John  January      Q1
17 2023-01-18       B   West    736     73   Mary  January      Q1
18 2023-01-19       C  North    554     58    Bob  January      Q1
19 2023-01-20       D  South    823     64  Alice  January      Q1

In [3]:
pd.pivot_table(df,values='Sales',index='Region',columns = 'Product')

Product      A      B      C      D
Region
East     604.4    NaN    NaN    NaN
North      NaN    NaN  480.2    NaN
South      NaN    NaN    NaN  833.0
West       NaN  732.0    NaN    NaN

In [4]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     604.4    NaN    NaN    NaN  36.4   NaN   NaN   NaN
North      NaN    NaN  480.2    NaN   NaN   NaN  55.2   NaN
South      NaN    NaN    NaN  833.0   NaN   NaN   NaN  62.2
West       NaN  732.0    NaN    NaN   NaN  73.2   NaN   NaN

### Cross Tab

In [5]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0